Show / Hide Table of Contents
Class GrpcReflectionInvokeData
Invokes a method over Grpc.
Inheritance
System.Object
GrpcReflectionInvokeData
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin.Grpc.Reflection
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public class GrpcReflectionInvokeData
Properties
Improve this Doc   View Source
MethodName
Nethod name to invoke.
Declaration
public string MethodName { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Parameters
Method parameters.
Declaration
public IEnumerable<GrpcReflectionArgument> Parameters { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.IEnumerable<GrpcReflectionArgument>
 Improve this Doc
 View Source